In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [22]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [23]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [24]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [25]:
type(df['W'])

pandas.core.series.Series

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [28]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [29]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [31]:
df.drop('new', axis=1, inplace=True)

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df.drop('E')

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [36]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [37]:
df.shape

(5, 4)

In [38]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [39]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [40]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [41]:
df.loc['B','Y']

0.16690463609281317

In [43]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [44]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [45]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [46]:
booldf = df > 0

In [47]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [51]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [52]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [53]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [54]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [55]:
df[df['W']>0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [56]:
df[df['W']>0][['X','Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [63]:
df[(df['W']>0) & (df['Y']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [64]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [75]:
df

          W         X         Y         Z states States
A  0.302665  1.693723 -1.706086 -1.159119     CA     CA
B -0.134841  0.390528  0.166905  0.184502     NY     NY
C  0.807706  0.072960  0.638787  0.329646     WY     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR     OR
E -0.116773  1.901755  0.238127  1.996652     CO     CO

In [76]:
df.reset_index()

  index         W         X         Y         Z states States
0     A  0.302665  1.693723 -1.706086 -1.159119     CA     CA
1     B -0.134841  0.390528  0.166905  0.184502     NY     NY
2     C  0.807706  0.072960  0.638787  0.329646     WY     WY
3     D -0.497104 -0.754070 -0.943406  0.484752     OR     OR
4     E -0.116773  1.901755  0.238127  1.996652     CO     CO

In [77]:
newind = 'CA NY WY OR CO'.split()

In [78]:
df['States'] = newind

In [79]:
df

          W         X         Y         Z states States
A  0.302665  1.693723 -1.706086 -1.159119     CA     CA
B -0.134841  0.390528  0.166905  0.184502     NY     NY
C  0.807706  0.072960  0.638787  0.329646     WY     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR     OR
E -0.116773  1.901755  0.238127  1.996652     CO     CO

In [80]:
df.set_index('States')

               W         X         Y         Z states
States
CA      0.302665  1.693723 -1.706086 -1.159119     CA
NY     -0.134841  0.390528  0.166905  0.184502     NY
WY      0.807706  0.072960  0.638787  0.329646     WY
OR     -0.497104 -0.754070 -0.943406  0.484752     OR
CO     -0.116773  1.901755  0.238127  1.996652     CO

          W         X         Y         Z states States
A  0.302665  1.693723 -1.706086 -1.159119     CA     CA
B -0.134841  0.390528  0.166905  0.184502     NY     NY
C  0.807706  0.072960  0.638787  0.329646     WY     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR     OR
E -0.116773  1.901755  0.238127  1.996652     CO     CO

# MultiIndex and Index Hierarchy

In [82]:
# INDEX LEVELS
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
#CREATE A LIST OF TUPLES
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [83]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [84]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [85]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [86]:
df.index.names

FrozenList([None, None])

In [87]:
df.index.names = ['Groups','Num']

In [88]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [94]:
df.loc['G2'].loc[2]['A']

2.154846443259472

In [95]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826